## dev plan
```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lambda.module.lambda_python_dependencies.aws_s3_object.lambda_generated_zip_file has been changed
  ~ resource "aws_s3_object" "lambda_generated_zip_file" {
        id                 = "dev/lambda/generated/output_event_message.zip"
+       metadata           = {}
+       tags               = {}
        # (11 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.output_event_message will be updated in-place
  ~ resource "aws_lambda_function" "output_event_message" {
        id                             = "dev-edp-output-event-message"
      ~ last_modified                  = "2022-05-15T14:09:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "KEQpdnGpbDY252Ls818v3Lt+PcjuxY+qHK4xHs3zdWg=" -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.lambda.module.lambda_python_dependencies.data.archive_file.lambda_generated_zip_file will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_generated_zip_file"  {
      ~ id                  = "e0230329821b942b290476ac5ecd0f78cc4f760f" -> (known after apply)
      ~ output_base64sha256 = "KEQpdnGpbDY252Ls818v3Lt+PcjuxY+qHK4xHs3zdWg=" -> (known after apply)
      ~ output_md5          = "cb8cad77086737ceda5e8b6b2d5fae34" -> (known after apply)
      ~ output_path         = "../../files/python_lambda_package/package.zip" -> (known after apply)
      ~ output_sha          = "e0230329821b942b290476ac5ecd0f78cc4f760f" -> (known after apply)
      ~ output_size         = 1235493 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda.module.lambda_python_dependencies.data.null_data_source.packaging_changes will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "packaging_changes"  {
      ~ has_computed_default = "default" -> (known after apply)
      ~ id                   = "static" -> (known after apply)
      ~ inputs               = {
          ~ "null_id"      = "9013528899667388037" -> (known after apply)
            # (1 unchanged element hidden)
        }
      ~ outputs              = {
-           "null_id"      = "9013528899667388037"
-           "package_path" = "../../files/python_lambda_package/package.zip"
        } -> (known after apply)
      ~ random               = "1483170731200571377" -> (known after apply)
    }

  # module.lambda.module.lambda_python_dependencies.aws_s3_object.lambda_generated_zip_file will be updated in-place
  ~ resource "aws_s3_object" "lambda_generated_zip_file" {
      ~ etag               = "cb8cad77086737ceda5e8b6b2d5fae34" -> (known after apply)
        id                 = "dev/lambda/generated/output_event_message.zip"
      ~ source             = "../../files/python_lambda_package/package.zip" -> (known after apply)
        tags               = {}
      ~ version_id         = "6IFNNPevj1M0WN4aFNzXLHB_7K3U1nsa" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.lambda.module.lambda_python_dependencies.null_resource.packaging must be replaced
-/+ resource "null_resource" "packaging" {
      ~ id       = "9013528899667388037" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "src_hash" = "53e6430af60f8b20f2d09ef3c3a933784811dd28" -> "3b4d5ab9c0623328965bde72c28fe33bee29a397"
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```